INSERT INTO Faculty.lesson
VALUES ('МКб-4301-51-00', 10, 'лекция', 17, '16-401'),
	   ('ФИб-4301-52-00', 10, 'практика', 18, '16-332'),
	   ('ПМИб-4402-52-00', 10, 'лабораторная', 17, '1-114'),
	   ('ПМИб-2202-52-00', 8, 'лекция', 19, '16-401');

INSERT INTO Faculty.mark
VALUES ('100003', '2021-06-05', 10, 17, '5'),
	   ('100004', '2021-06-05', 10, 17, '4'),
	   ('100005', '2021-06-05', 10, 17, '5'),
	   ('100006', '2021-06-06', 8, 4, 'зачет');

INSERT INTO Faculty.teacher_department
VALUES (17, 3, 'Преподаватель'),
	   (18, 4, 'Старший преподаватель'),
	   (19, 5, 'Преподаватель'),
	   (20, 6, 'Доцент');