CREATE TABLE Faculty.graduate (
"ВыпускникID" SERIAL4 NOT NULL PRIMARY KEY,
"Группа" VARCHAR(20),
"ФИО" VARCHAR(100) NOT NULL,
"Пол" CHAR(1) CHECK ("Пол" IN ('м', 'ж')),
"ДатаРождения" DATE CHECK ("ДатаРождения" <= CURRENT_DATE),
"Адрес" VARCHAR(100) DEFAULT 'Неизвестно',
"Сотовый телефон" CHAR(12) CHECK ("Сотовый телефон" ~ '^\+7[0-9]{10}$'),
"Почта" VARCHAR(100),
"Год поступления" CHAR(4),
"Проживает в общежитии" VARCHAR(3) NOT NULL DEFAULT 'нет' CHECK ("Проживает в общежитии" IN ('да', 'нет'))
);

INSERT INTO Faculty.graduate("Группа", "ФИО", "Пол", "ДатаРождения", "Адрес", "Сотовый телефон", "Год поступления", "Проживает в общежитии")
	SELECT "Группа", "Фамилия" || ' ' || "Имя" || ' ' || "Отчество", "Пол", "ДатаРождения", "Адрес", "СотовыйТелефон", "ГодПоступления", "Общежитие"
	FROM Faculty.student
	WHERE "Группа" ~ '^.*-4.*$';