INSERT INTO Faculty.classroom
VALUES ('16-332', '40', false, true),
	   ('14-107', '50', false, false),
	   ('16-408', '20', true, true),
	   ('1-114', '80', false, true);

INSERT INTO Faculty.teacher ("Фамилия", "Имя", "Отчество", "ДатаПринятияНаРаботу")
VALUES ('Сидоренко', 'Максим', 'Сергеевич', '2019-11-24'),
	   ('Матвиенко', 'Артем', 'Викторович', '1999-12-01'),
	   ('Ветошкин', 'Александр', 'Юрьевич', '2015-01-01'),
	   ('Горбачев', 'Владислав', 'Анатольевич', '1980-05-06');

INSERT INTO Faculty.subject ("Название", "КоличествоЛекционныхЧасов", "КоличествоПрактическихЧасов", "КоличествоЛабораторныхЧасов", "СеместрИзучения", "ФормаКонтроля")
VALUES ('Математический анализ', '100', '50', '50', '1', 'экзамен'),
	   ('Аналитическая геометрия', '100', '60', '60', '2', 'зачет'),
	   ('Английский язык', '130', '20', '50', '1', 'экзамен'),
	   ('Физика', '100', '80', '80', '4', 'зачет + экзамен');

INSERT INTO Faculty.department ("Код кафедры", "Название кафедры", "Подразделение")
VALUES (3, 'Прикладной информатики', 'ИМИС'),
	   (4, 'Иностранных языков', 'ИГСН'),
	   (5, 'Юриспруденции', 'ЮИ'),
	   (6, 'Педагогики', 'ПИ');