INSERT INTO Faculty.student ("НомерЗачетнойКнижки", "Фамилия", "Имя", "Отчество", "Пол", "ГодПоступления", "Общежитие", "Группа")
VALUES ('100003', 'Сидоров', 'Иван', 'Иванович', 'м', '2018', 'да', 'МКб-4301-51-00'),
	   ('100004', 'Степанин', 'Николай', 'Игоревич', 'м', '2019', 'нет', 'ПМИб-4402-52-00'),
	   ('100005', 'Перминов', 'Артем', 'Николаевич', 'м', '2018', 'да', 'ФИб-4301-52-00'),
	   ('100006', 'Куратов', 'Петр', 'Ильич', 'м', '2021', 'да', 'ПМИб-2202-52-00'),
	   ('100007', 'Иванцов', 'Кирилл', 'Федорович', 'м', '2021', 'нет', 'ФИб-2301-52-00');